<?php

/*
1. С помощью цикла while вывести все числа в промежутке от 0 до 100, которые делятся на 3 без остатка.
*/

$i = 0;

while ($i <= 100) {
    echo $i % 3 == 0 ? $i . ' ' : '';
    $i++;
}

echo "<br>";

/*
2. С помощью цикла do…while написать функцию для вывода чисел от 0 до 10, чтобы результат выглядел так:
*/

$i = 0;

do {
    if ($i === 0) {
        echo $i . " – ноль.<br>";
    } elseif ($i % 2 === 0) {
        echo $i . " – чётное число.<br>";
    } else {
        echo $i . " – нечётное число.<br>";
    }
    $i++;
} while ($i <= 10);

echo "<br>";

/*
3. Объявить массив, в котором в качестве ключей будут использоваться названия областей, а в качестве значений – 
массивы с названиями городов из соответствующей области. Вывести в цикле значения массива, чтобы результат был таким: */

//способ1
$city = [
    "Московская область" => ["Москва", "Зеленоград", "Клин"],
    "Ленинградская область" => ["Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"],
    "Рязянаская область" => ["Михайлов", "Рыбное", "Спасск-Рязанский", "Кораблино"]
];

foreach ($city as $key => $value) {
    echo $key . ":<br>";
    echo implode(", ", $value) . ".<br>";
}

echo "<br>";

//способ2

$city = [
    "Московская область" => ["Москва", "Зеленоград", "Клин"],
    "Ленинградская область" => ["Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"],
    "Рязянаская область" => ["Михайлов", "Рыбное", "Спасск-Рязанский", "Кораблино"]
];

foreach ($city as $key => $value) {
    echo $key . ":<br>";
    $str = "";
    foreach ($value as $item) {
        $str .= $item . ", ";
    }
    $str = substr_replace($str, ".", -2, 2);
    echo $str . "<br>";
}

echo "<br>";

/* 
4. Объявить массив, индексами которого являются буквы русского языка, а значениями – соответствующие латинские 
буквосочетания (‘а’=> ’a’, ‘б’ => ‘b’, ‘в’ => ‘v’, ‘г’ => ‘g’, …, ‘э’ => ‘e’, ‘ю’ => ‘yu’, ‘я’ => ‘ya’).
Написать функцию транслитерации строк. Она должна учитывать и заглавные буквы. 
*/

//простой_способ
$text1 = 'Фраза, которая будет транcлитерирована';

$alfabet = [
    'а' => 'a',   'б' => 'b',   'в' => 'v',
    'г' => 'g',   'д' => 'd',   'е' => 'e',
    'ё' => 'e',   'ж' => 'zh',  'з' => 'z',
    'и' => 'i',   'й' => 'y',   'к' => 'k',
    'л' => 'l',   'м' => 'm',   'н' => 'n',
    'о' => 'o',   'п' => 'p',   'р' => 'r',
    'с' => 's',   'т' => 't',   'у' => 'u',
    'ф' => 'f',   'х' => 'h',   'ц' => 'c',
    'ч' => 'ch',  'ш' => 'sh',  'щ' => 'sch',
    'ь' => '\'',  'ы' => 'y',   'ъ' => '\'',
    'э' => 'e',   'ю' => 'yu',  'я' => 'ya'
];

function translit($text, $alfabet)
{
    $text = mb_strtolower($text);
    $text = strtr($text, $alfabet);
    return ucfirst($text);
}

echo $text1 . "<br>";
echo translit($text1, $alfabet);

echo "<br>";

//без готовой strtr: 

$text1 = 'Фраза, котораЯ будет транcлитерированаЩ!';
echo $text1 . "<br>";

$alfabet = [
    'а' => 'a',   'б' => 'b',   'в' => 'v',
    'г' => 'g',   'д' => 'd',   'е' => 'e',
    'ё' => 'e',   'ж' => 'zh',  'з' => 'z',
    'и' => 'i',   'й' => 'y',   'к' => 'k',
    'л' => 'l',   'м' => 'm',   'н' => 'n',
    'о' => 'o',   'п' => 'p',   'р' => 'r',
    'с' => 's',   'т' => 't',   'у' => 'u',
    'ф' => 'f',   'х' => 'h',   'ц' => 'c',
    'ч' => 'ch',  'ш' => 'sh',  'щ' => 'sch',
    'ь' => '\'',  'ы' => 'y',   'ъ' => '\'',
    'э' => 'e',   'ю' => 'yu',  'я' => 'ya'
];

function translit1($text, $alfabet){

    $result = "";

    for($i = 0; $i < mb_strlen($text); $i++){
        $letter = mb_substr($text, $i, 1);
        $low_letter = mb_strtolower($letter);


        if(isset($alfabet[$low_letter])) {
            if($letter === $low_letter){
                $latin_letter = $alfabet[$letter];
            } else {
                $latin_letter = ucfirst($alfabet[$low_letter]);
            }
        } else {
            $latin_letter = $low_letter;
        }
    
        $result .= $latin_letter;
    }

    return $result;
}

echo translit1($text1, $alfabet);

echo "<br>";

/* 5. Написать функцию, которая заменяет в строке пробелы на подчеркивания и возвращает видоизмененную строчку. 
Можно через str_replace */

$text1 = 'Здесь мог быть ваш  текст.';
$text2 = 'Ну или здесь  .';

function changeText($text)
{
    return str_replace(' ', '_', $text);
}

echo $text1 . "<br>";
echo changeText($text1) . "<br>";
echo $text2 . "<br>";
echo changeText($text2) . "<br>";

//7. Вывести с помощью цикла for числа от 0 до 9, не используя тело цикла. Выглядеть должно так: for (…){ // здесь пусто}

for ($i = 0; $i <= 9; print $i++ . ' ') {
}

echo "<br>";

//8. Повторить третье задание, но вывести на экран только города, начинающиеся с буквы «К».

$city = [
    "Московская область" => ["Москва", "Зеленоград", "Клин"],
    "Ленинградская область" => ["Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"],
    "Рязянаская область" => ["Михайлов", "Рыбное", "Спасск-Рязанский", "Кораблино"]
];

foreach ($city as $key => $value) {
    echo $key . ":<br>";
    foreach ($value as $value1) {
        mb_substr($value1, 0, 1) != "К" ?: print $value1 . "<br>";
    }
}

echo "<br>";

/*9. Объединить две ранее написанные функции в одну, которая получает строку на русском языке, 
производит транслитерацию и замену пробелов на подчеркивания */

$phrase1 = 'Фраза, которая будет транcлитерирована  ';

function updateText($text, $alfabet)
{
    return translit((changeText($text)), $alfabet);
}

echo $phrase1 . "<br>";
echo updateText($phrase1, $alfabet);
